riverosi/firmware/modules/lpc4337_m4/drivers_devices/src/nrf24l01.c
/* nRF24L01.c
 *
 *  ORIGINAL LIBRARY REPOSITORY: https://github.com/pradeepa-s/pdlib_nrf24l01
 *  See LICENSE-NRF24L01 attached on folder or visit ORIGINAL LIBRARY REPOSITORY
 *
 *  Copyright (C) 2015 Pradeepa Senanayake <pradeepa.kck@gmail.com>
 *  Copyright (C) 2018 Julián Botello <jlnbotello@gmail.com>
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 */

/** @addtogroup NRF24L01
 *  @{
 */

/*==================[inclusions]=============================================*/

#include "nrf24l01.h"
#include "chip.h"
#include "string.h"

/*==================[macros and definitions]=================================*/

#define INTERNAL_STATE_INIT				(1 << 0)	/**< Initial state Flag */
#define INTERNAL_STATE_DYNPL			(1 << 1)	/**< Dynamic Payload Flag  */
#define INTERNAL_STATE_ACKPL			(1 << 2)	/**< Acknowledge Payload Flag  */
#define INTERNAL_STATE_FEATURE_ENABLED	(1 << 3)	/**< Feature Enabled Flag  */
#define INTERNAL_STATE_POWER_UP			(1 << 4)	/**< Power Up Flag  */
#define INTERNAL_STATE_STAND_BY			(1 << 5)	/**< Stand By Flag  */

#define NUMBER_OF_DEVICES	2 	/**< Two are used when testing driver. One dev board with 2 RF modules (PRX AND PTX) */

#define BUF_SIZE 	32 			/**< Max payload */

/*==================[external data definition]===============================*/

/* Buffers of PTX */
uint8_t snd_to_PRX[BUF_SIZE]; /**< Data to send to PRX */
uint8_t rcv_fr_PRX[BUF_SIZE]; /**< Data received from PRX */
/* Buffers of PRX */
uint8_t snd_to_PTX[BUF_SIZE]; /**< Data to send to PTX */
uint8_t rcv_fr_PTX[BUF_SIZE]; /**< Data received from PTX  */

/*==================[internal data definition]===============================*/

static nrf24l01_t* primary_dev; /**< RX or TX. When testing assign TX (two RF modules in the same dev board) */
static nrf24l01_t* secondary_dev; /**< RX if there are two RF modules in the same dev board */
static uint16_t internal_states[NUMBER_OF_DEVICES]; /**< Internal states */
static uint8_t g_status[NUMBER_OF_DEVICES]; /**< Global status*/

const spiConfig_t nrf24l01_spi_default_cfg = { SSP_1, SPI_BITS8, SPI_CLK_MODE0, 1000000}; //max 8MHz

/*==================[internal functions definition]==========================*/

/*-------- SPI and GPIO control --------*/

static uint8_t Nrf24SpiReadByte(nrf24l01_t *nrf24) {
	uint8_t rx_byte;
	SpiDevReadBlocking(&nrf24->spi, &rx_byte, 1);
	return rx_byte;
}

static uint8_t Nrf24SpiReadWriteByte(nrf24l01_t *nrf24, uint8_t tx_byte) {
	uint8_t rx_byte;
	SpiDevRWBlocking(&nrf24->spi, &tx_byte, &rx_byte, 1);
	return rx_byte;
}

static void Nrf24SpiWriteMultiByte(nrf24l01_t *nrf24, uint8_t *buffer, uint32_t n) {
	SpiDevWriteBlocking(&nrf24->spi, buffer, n);
}

static void Nrf24CeLow(nrf24l01_t *nrf24) {
	//GpioWrite(&nrf24->ce, GPIO_LOW);
	GPIOState(nrf24->ce, 0 );
	if (internal_states[nrf24->spi.id] & INTERNAL_STATE_POWER_UP) {
		internal_states[nrf24->spi.id] |= INTERNAL_STATE_STAND_BY;
	} else {
		internal_states[nrf24->spi.id] &= (~INTERNAL_STATE_STAND_BY);
	}
}

static void Nrf24CeHigh(nrf24l01_t *nrf24) {
	//GpioWrite(&nrf24->ce, GPIO_HIGH);
	GPIOState(nrf24->ce, 1 );

	if (internal_states[nrf24->spi.id] & INTERNAL_STATE_POWER_UP) {
		internal_states[nrf24->spi.id] &= (~INTERNAL_STATE_STAND_BY);
	}
}

static void Nrf24CsLow(nrf24l01_t *nrf24) {
	//GpioWrite(&nrf24->cs, GPIO_LOW);
	GPIOState(nrf24->cs , 0);
}

static void Nrf24CsHigh(nrf24l01_t *nrf24) {
	//GpioWrite(&nrf24->cs, GPIO_HIGH);
	GPIOState(nrf24->cs , 1);
}

/*==================[external functions definition]=========================*/

/*-------- Basic APIs --------*/

uint8_t Nrf24Init(nrf24l01_t *nrf24) {
	int8_t ret = NRF24_ERROR;
	SpiDevInit(&nrf24->spi);

	//nrf24->cs = GPIO_OUT;
	//nrf24->cs.init_st = GPIO_HIGH; //CS is active LOW
	//GpioConfig(&nrf24->cs);
	GPIOInit( nrf24->cs , GPIO_OUTPUT);
	GPIOOn( nrf24->cs );


	//nrf24->ce.dir = GPIO_OUT;
	//nrf24->ce.init_st = GPIO_LOW; //CE is active HIGH
	//GpioConfig(&nrf24->ce);
	GPIOInit( nrf24->cs , GPIO_OUTPUT);
	GPIOOff( nrf24->ce );


	Nrf24RegisterInit(nrf24);

	internal_states[nrf24->spi.id] = 0x00;
	internal_states[nrf24->spi.id] |= INTERNAL_STATE_INIT;

	if ( Nrf24RegisterRead8(nrf24, NRF24_RX_PW_P0 ) == 0x00) {
		ret = NRF24_SUCCESS;
	}
	return ret;
}

int8_t Nrf24SendData(nrf24l01_t *nrf24, uint8_t *data, uint32_t length) {
	int8_t ret = Nrf24SubmitData(nrf24, data, length);

	if (ret == NRF24_SUCCESS) {
		ret = Nrf24AttemptTx(nrf24);
	}
	return ret;
}

int8_t Nrf24SendDataTo(nrf24l01_t *nrf24, uint8_t *address, uint8_t *data, uint32_t length) {
	int8_t ret;

	Nrf24SetTXAddress(nrf24, address);

	ret = Nrf24SendData(nrf24, data, length);

	return ret;
}

int8_t Nrf24WaitForDataRx(nrf24l01_t *nrf24, uint8_t *pipe) {
	int8_t ret = NRF24_ERROR;

	Nrf24EnableRxMode(nrf24);
	// Blocking
	while (ret == NRF24_ERROR) {
		ret = Nrf24IsDataReadyRx(nrf24, pipe);
	}
	Nrf24DisableRxMode(nrf24);

	return ret;
}

uint8_t Nrf24GetRxDataAmount(nrf24l01_t *nrf24, uint8_t pipe) {
	uint8_t reg;
	uint8_t ret = 0;

	if ((INTERNAL_STATE_DYNPL & internal_states[nrf24->spi.id]) == 0) {
		if (pipe < 6) {
			// static payload width register of Px;  x:0..5
			reg = Nrf24RegisterRead8(nrf24, NRF24_RX_PW_P0 + pipe);
			ret = (reg & 0x3F);
		} else {
			ret = 0;
		}
	} else {
		Nrf24SendRcvCommand(nrf24, NRF24_R_RX_PL_WID, &reg, 1);

		ret = reg;
	}

	return ret;
}

int8_t Nrf24GetData(nrf24l01_t *nrf24, uint8_t pipe, uint8_t *data,	uint8_t length) {
	int8_t ret = NRF24_SUCCESS;
	uint8_t fifo_status;
	uint8_t ready_length;
	uint8_t ready_pipe;

	if (null == data) {
		ret = NRF24_INVALID_ARGUMENT;
	} else {
		if (NRF24_SUCCESS == Nrf24IsDataReadyRx(nrf24, &ready_pipe)) {
			if (pipe == ready_pipe) {
				// Gets FIFO status
				fifo_status = Nrf24RegisterRead8(nrf24, NRF24_FIFO_STATUS);

				// Checks whether FIFO is empty
				if (0 == (fifo_status & NRF24_RX_EMPTY)) {

