riverosi/firmware/modules/lpc4337_m4/drivers_devices/src/nrf24l01.c
					//  Gets amount of data available
					ready_length = Nrf24GetRxDataAmount(nrf24, pipe);

					if ((length) >= ready_length) {
						(length) = ready_length;
					} else {
						// If the actual buffer size is smaller than the available data, we can miss data.
						ret = NRF24_BUFFER_TOO_SMALL;
					}

					if (NRF24_SUCCESS == ret) {

						// Read RX payload
						Nrf24ReadRxPayload(nrf24, data, ready_length);

						// TODO: Check whether we need to check the actual FIFO state before clearing the interrupt.
						// Clear RX_DR
						Nrf24ClearInterruptFlag(nrf24, INTERRUPT_DATA_READY);

						ret = ready_length;
					}

				} else {
					ret = NRF24_ERROR;
				}
			} else {
				ret = NRF24_INVALID_ARGUMENT;
			}
		} else {
			ret = NRF24_ERROR;
		}
	}

	return ret;
}

/*-------- Intermediate APIs --------*/

void Nrf24RegisterInit(nrf24l01_t *nrf24) {
	uint8_t ucRxAddr1[5] = { 0xE7, 0xE7, 0xE7, 0xE7, 0xE7 };
	uint8_t ucRxAddr2[5] = { 0xC2, 0xC2, 0xC2, 0xC2, 0xC2 };

	Nrf24FlushTX(nrf24);
	Nrf24FlushRX(nrf24);

	Nrf24CeLow(nrf24);
	//FIXME
	//Nrf24RegisterWrite8(nrf24,NRF24_CONFIG,0x09);
	Nrf24RegisterWrite8(nrf24, NRF24_CONFIG, NRF24_EN_CRC | NRF24_PRIM_RX);
	//Nrf24RegisterWrite8(nrf24,NRF24_EN_AA,0x3F);
	Nrf24RegisterWrite8(nrf24, NRF24_EN_AA,
			NRF24_ENAA_P5 | NRF24_ENAA_P4 | NRF24_ENAA_P3 | NRF24_ENAA_P2
					| NRF24_ENAA_P1 | NRF24_ENAA_P0);
	//Nrf24RegisterWrite8(nrf24,NRF24_EN_RXADDR,0x03);
	Nrf24RegisterWrite8(nrf24, NRF24_EN_RXADDR, NRF24_ERX_P1 | NRF24_ERX_P0);
	//Nrf24RegisterWrite8(nrf24,NRF24_SETUP_AW,0x03);
	Nrf24RegisterWrite8(nrf24, NRF24_SETUP_AW, NRF24_AW_5BYTES);
	//Nrf24RegisterWrite8(nrf24,NRF24_SETUP_RETR,0x03);
	Nrf24RegisterWrite8(nrf24, NRF24_SETUP_RETR, 0x00 | 0x03); //ARD(Auto Retransmit Delay)|ARC(Auto Retransmit Count) 250 us | 3 retransmitions
	Nrf24RegisterWrite8(nrf24, NRF24_RF_CH, 0x02); // Set channel in 0x02
	Nrf24RegisterWrite8(nrf24, NRF24_RF_SETUP, 0x0F); // Air data rate 2Mbps | max power output | setup LNA gain
	Nrf24RegisterWrite8(nrf24, NRF24_STATUS, 0x70); // Clears interrupts RX_DR, TX_DS and MAX_RT
	//Nrf24RegisterWrite8(nrf24,NRF24_CD, 0x00); Not necessary. Read only register
	Nrf24RegisterWriteMulti(nrf24, NRF24_RX_ADDR_P0, ucRxAddr1, 5); // Writes default RX address in P0.
	Nrf24RegisterWriteMulti(nrf24, NRF24_RX_ADDR_P1, ucRxAddr2, 5); // Writes default RX address in P1.
	Nrf24RegisterWrite8(nrf24, NRF24_RX_ADDR_P2, 0xC3); // First MSBytes equal to P1. Writes last(right) byte address.
	Nrf24RegisterWrite8(nrf24, NRF24_RX_ADDR_P3, 0xC4); // First MSBytes equal to P1
	Nrf24RegisterWrite8(nrf24, NRF24_RX_ADDR_P4, 0xC5); // First MSBytes equal to P1
	Nrf24RegisterWrite8(nrf24, NRF24_RX_ADDR_P5, 0xC6); // First MSBytes equal to P1
	Nrf24RegisterWriteMulti(nrf24, NRF24_TX_ADDR, ucRxAddr1, 5); //Writes default TX address
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P0, 0x00); // Pipe not used because 0 bytes payload. MUST BE SET LATER
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P1, 0x00); // Pipe not used because 0 bytes payload
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P2, 0x00); // Pipe not used because 0 bytes payload
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P3, 0x00); // Pipe not used because 0 bytes payload
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P4, 0x00); // Pipe not used because 0 bytes payload
	Nrf24RegisterWrite8(nrf24, NRF24_RX_PW_P5, 0x00); // Pipe not used because 0 bytes payload
	Nrf24RegisterWrite8(nrf24, NRF24_DYNPD, 0x00); //dynamic payload disable in all pipes
	Nrf24RegisterWrite8(nrf24, NRF24_FEATURE, 0x00);
}

void Nrf24PowerDown(nrf24l01_t *nrf24) {
	uint8_t current_val = Nrf24RegisterRead8(nrf24, NRF24_CONFIG);
	current_val &= (~NRF24_PWR_UP);

	Nrf24RegisterWrite8(nrf24, NRF24_CONFIG, current_val);

	Nrf24CeLow(nrf24);

	internal_states[nrf24->spi.id] &= (~INTERNAL_STATE_POWER_UP);
}

void Nrf24PowerUp(nrf24l01_t *nrf24) {
	uint8_t current_val = Nrf24RegisterRead8(nrf24, NRF24_CONFIG);
	current_val |= (NRF24_PWR_UP);
	Nrf24RegisterWrite8(nrf24, NRF24_CONFIG, current_val);

	internal_states[nrf24->spi.id] |= INTERNAL_STATE_POWER_UP;
}

void Nrf24SetARD(nrf24l01_t *nrf24, uint16_t value) {
	uint8_t reg_val = 0;
	uint8_t cur_val = 0;

	if (value < 250) {
		value = 250;
	}

	// 250 - 0x0000
	// 500 - 0x0001
	// ...
	// 4000 - 0x1111
	value = ((value / 250) - 1);

	reg_val = ((value << 4) & 0xF0);

	cur_val = Nrf24RegisterRead8(nrf24, NRF24_SETUP_RETR);
	cur_val &= 0x0F;
	cur_val |= reg_val;
	Nrf24RegisterWrite8(nrf24, NRF24_SETUP_RETR, cur_val);
}

uint8_t Nrf24GetStatus(nrf24l01_t *nrf24) {
	Nrf24RegisterRead8(nrf24, NRF24_NOP);
	return g_status[nrf24->spi.id];
}

void Nrf24EnableFeatureDynPL(nrf24l01_t *nrf24, uint8_t pipe) {
	uint8_t data = 0x73;

	if ((internal_states[nrf24->spi.id] & INTERNAL_STATE_STAND_BY)
			|| (0 == (internal_states[nrf24->spi.id] & INTERNAL_STATE_POWER_UP))) {
		// Check whether features register is activated
		if (0
				== (internal_states[nrf24->spi.id]
						& INTERNAL_STATE_FEATURE_ENABLED)) {
			uint8_t data = 0x73;
			Nrf24SendCommand(nrf24, NRF24_ACTIVATE, &data, 1);

			internal_states[nrf24->spi.id] |= INTERNAL_STATE_FEATURE_ENABLED;
		}

		// Check whether DYN-PL feature is activated
		data = Nrf24RegisterRead8(nrf24, NRF24_FEATURE);

		if (0 == (data & NRF24_EN_DPL)) {
			Nrf24RegisterWrite8(nrf24, NRF24_FEATURE, (data | NRF24_EN_DPL));
		}

		if (pipe <= 6) {
			// Check whether DYN-PD for 'pipe' is activated
			data = Nrf24RegisterRead8(nrf24, NRF24_DYNPD);

			if (0 == (data & pipe)) {
				Nrf24RegisterWrite8(nrf24, NRF24_DYNPD,
						(data | (1 << pipe)));
			}
		}

		internal_states[nrf24->spi.id] |= INTERNAL_STATE_DYNPL;
	}
}

void Nrf24EnableFeatureAckPL(nrf24l01_t *nrf24) {
	uint8_t data = 0x73;

	if ((internal_states[nrf24->spi.id] & INTERNAL_STATE_STAND_BY)
			|| (0 == (internal_states[nrf24->spi.id] & INTERNAL_STATE_POWER_UP))) {
		//  Enable dynpl for pipe0
		Nrf24EnableFeatureDynPL(nrf24, 0x00);

		//  Check whether retransmission delay is sufficient
		data = Nrf24RegisterRead8(nrf24, NRF24_SETUP_RETR);

