riverosi/firmware/modules/lpc4337_m4/drivers_devices/src/nrf24l01.c
		if (0 == ((data & 0xF0) >> 4)) {
			Nrf24SetARD(nrf24, 500);
		}

		//  Enable auto ack payload
		data = Nrf24RegisterRead8(nrf24, NRF24_FEATURE);
		Nrf24RegisterWrite8(nrf24, NRF24_FEATURE, (data | NRF24_EN_ACK_PAY));

		internal_states[nrf24->spi.id] |= INTERNAL_STATE_ACKPL;
	}
}

uint8_t Nrf24GetInterruptStatus(nrf24l01_t *nrf24) {
	uint8_t status = Nrf24GetStatus(nrf24);

	status &= (NRF24_RX_DR | NRF24_TX_DS | NRF24_MAX_RT);
	status = (status >> 4);

	return status;
}

void Nrf24ClearInterruptFlag(nrf24l01_t *nrf24, uint8_t interrupt_bm) {
	uint8_t status = Nrf24GetStatus(nrf24);

	status &= ~(NRF24_RX_DR | NRF24_TX_DS | NRF24_MAX_RT);
	// Write 1 to clear bit
	if (interrupt_bm & INTERRUPT_MAX_RT) {
		status |= NRF24_MAX_RT;
	}

	if (interrupt_bm & INTERRUPT_DATA_READY) {
		status |= NRF24_RX_DR;
	}

	if (interrupt_bm & INTERRUPT_DATA_SENT) {
		status |= NRF24_TX_DS;
	}

	Nrf24RegisterWrite8(nrf24, NRF24_STATUS, status);
}

/*-------- TX mode related --------*/

void Nrf24FlushTX(nrf24l01_t *nrf24) {
	Nrf24SendCommand(nrf24, NRF24_FLUSH_TX, null, 0);
}

void Nrf24SetTXAddress(nrf24l01_t *nrf24, uint8_t* address) {
	Nrf24RegisterWriteMulti(nrf24, NRF24_TX_ADDR, (uint8_t*) address, 5);
}

int8_t Nrf24SetTxPayload(nrf24l01_t *nrf24, uint8_t* data, uint32_t length) {
	int8_t ret = NRF24_SUCCESS;

	if (data && length > 0) {
		//  Check whether TX fifo is full
		if (Nrf24IsTxFifoFull(nrf24)) {
			ret = NRF24_TX_FIFO_FULL;

		} else {
			Nrf24SendCommand(nrf24, NRF24_W_TX_PAYLOAD, data, length);
		}
	} else {
		ret = NRF24_ERROR;
	}

	return ret;
}

int8_t Nrf24SubmitData(nrf24l01_t *nrf24, uint8_t *data, uint32_t length) {
	int8_t ret;
	uint8_t address[5];
	uint8_t current_val;

	current_val = Nrf24RegisterRead8(nrf24, NRF24_EN_AA);
	 // Check the Auto Ack feature
	if (current_val & NRF24_ENAA_P0) {
		// Make sure the data pipe 0 has the correct PTX address
		Nrf24RegisterReadMulti(nrf24, NRF24_TX_ADDR, address, 5);
		Nrf24SetRxAddress(nrf24, NRF24_PIPE0, address);
	}
	ret = Nrf24SetTxPayload(nrf24, data, length);

	return ret;
}

void Nrf24EnableTxMode(nrf24l01_t *nrf24) {
	uint8_t current_val = 0;

	//  Power up the device
	Nrf24PowerUp(nrf24);

	//  Clear TX_DS and MAX_RT interrupts
	Nrf24ClearInterruptFlag(nrf24,INTERRUPT_MAX_RT | INTERRUPT_DATA_SENT);

	//  Set to TX mode
	current_val = Nrf24RegisterRead8(nrf24, NRF24_CONFIG);
	current_val &= (~NRF24_PRIM_RX);

	Nrf24RegisterWrite8(nrf24, NRF24_CONFIG, current_val);

	Nrf24CeHigh(nrf24);

}

void Nrf24DisableTxMode(nrf24l01_t *nrf24) {
	//uint8_t current_val = Nrf24GetStatus(nrf24);

	Nrf24CeLow(nrf24);
	//  Clear TX_DS and MAX_RT interrupts TODO: why?
	Nrf24ClearInterruptFlag(nrf24, INTERRUPT_MAX_RT | INTERRUPT_DATA_SENT);
}

uint8_t Nrf24IsTxFifoFull(nrf24l01_t *nrf24) {
	uint8_t tx_fifo_status;

	tx_fifo_status = Nrf24RegisterRead8(nrf24, NRF24_FIFO_STATUS);

	return ((tx_fifo_status & NRF24_FIFO_FULL) ? 1 : 0);
}

int8_t Nrf24IsTxFifoEmpty(nrf24l01_t *nrf24) {
	uint8_t tx_fifo_status;

	tx_fifo_status = Nrf24RegisterRead8(nrf24, NRF24_FIFO_STATUS);

	return ((tx_fifo_status & NRF24_TX_EMPTY) ? 1 : 0);
}

int8_t Nrf24AttemptTx(nrf24l01_t *nrf24) {
	int8_t ret = NRF24_SUCCESS;

	Nrf24EnableTxMode(nrf24);

	ret = Nrf24WaitForTxComplete(nrf24, 1);

	Nrf24DisableTxMode(nrf24);

	Nrf24PowerDown(nrf24);

	return ret;
}

int8_t Nrf24WaitForTxComplete(nrf24l01_t *nrf24, uint8_t busy_wait) {
	int8_t ret = NRF24_SUCCESS;

	Nrf24GetStatus(nrf24);

	if (busy_wait) {
		while ((g_status[nrf24->spi.id] & (NRF24_MAX_RT | NRF24_TX_DS)) == 0) {
			Nrf24GetStatus(nrf24);
		}
	} else {
		if ((g_status[nrf24->spi.id] & (NRF24_MAX_RT | NRF24_TX_DS)) == 0) {
			ret = NRF24_ERROR;
		}
	}

	if (g_status[nrf24->spi.id] & NRF24_MAX_RT) {

		ret = NRF24_TX_ARC_REACHED;
	}

	return ret;
}

uint8_t Nrf24GetAckDataAmount(nrf24l01_t *nrf24){
	uint8_t data_amount = 0;

	Nrf24SendRcvCommand(nrf24,NRF24_R_RX_PL_WID,&data_amount,1);

	return data_amount;
}

/*-------- RX mode related --------*/

void Nrf24FlushRX(nrf24l01_t *nrf24) {
	Nrf24SendCommand(nrf24, NRF24_FLUSH_RX, null, 0);
}

void Nrf24SetRxAddress(nrf24l01_t *nrf24, uint8_t pipe, uint8_t *address) {
	if (address) {
		switch (pipe) {
		case 0:
		case 1:
			Nrf24RegisterWriteMulti(nrf24, (NRF24_RX_ADDR_P0 + pipe),
					address, 5);
			break;
		case 2:
		case 3:
		case 4:
		case 5:
			Nrf24RegisterWrite8(nrf24, (NRF24_RX_ADDR_P0 + pipe),
					address[0]);
			break;
		default:
			break;
		}
	}
}

void Nrf24SetRXPacketSize(nrf24l01_t *nrf24, uint8_t pipe, uint8_t pkt_sz) {
	if (pkt_sz <= 32) {
		Nrf24RegisterWrite8(nrf24, (NRF24_RX_PW_P0 + pipe),pkt_sz);
	}
}

void Nrf24EnableRxMode(nrf24l01_t *nrf24) {
	uint8_t current_val = Nrf24GetStatus(nrf24);

	Nrf24PowerUp(nrf24);

	//  Clear RX_DR interrupt
	Nrf24ClearInterruptFlag(nrf24, INTERRUPT_DATA_READY);

	current_val = Nrf24RegisterRead8(nrf24, NRF24_CONFIG);
	current_val |= (NRF24_PRIM_RX | NRF24_PWR_UP);

	Nrf24RegisterWrite8(nrf24, NRF24_CONFIG, current_val);

	Nrf24CeHigh(nrf24);
}

void Nrf24DisableRxMode(nrf24l01_t *nrf24) {
	Nrf24CeLow(nrf24);
}

int8_t Nrf24IsDataReadyRx(nrf24l01_t *nrf24, uint8_t *pipe) {
	int8_t ret = NRF24_ERROR;
	uint8_t data_ready;

	if (null == pipe) {
		ret = NRF24_INVALID_ARGUMENT;
	} else {
		Nrf24GetStatus(nrf24);

		data_ready = ((g_status[nrf24->spi.id] & NRF24_RX_DR) ? 1 : 0);
		*pipe = ((g_status[nrf24->spi.id] & ( BIT3 | BIT2 | BIT1)) >> 1);

		// pipe will be 7 if the RX fifo is empty
		if (data_ready && (*pipe < 6)) {
			ret = NRF24_SUCCESS;
		} else {
			// Reset the value in the pipe number
			*pipe = 0xFF;
			ret = NRF24_ERROR;
		}
	}

	return ret;
}

void Nrf24ReadRxPayload(nrf24l01_t *nrf24, uint8_t* data, uint8_t length) {
	Nrf24SendRcvCommand(nrf24, NRF24_R_RX_PAYLOAD, data, length);
}

int8_t Nrf24SetAckPayload(nrf24l01_t *nrf24, uint8_t *data, uint8_t pipe, uint32_t length) {
	int8_t ret = NRF24_SUCCESS;
	uint8_t address = pipe;

	if (pipe < 6 && data && length > 0) {
		//  Check whether TX fifo is full
		if (Nrf24IsTxFifoFull(nrf24)) {
			ret = NRF24_TX_FIFO_FULL;
		} else {
			address = address & 0x07;
			address |= NRF24_W_ACK_PAYLOAD;

			Nrf24SendCommand(nrf24, address, data, length);
		}
	} else {
		ret = NRF24_ERROR;
	}

	return ret;
}

/*-------- Advanced APIs, Register level access --------*/

uint8_t Nrf24RegisterRead8(nrf24l01_t *nrf24, uint8_t reg) {
	uint8_t ucData;

	Nrf24CsLow(nrf24);

