riverosi/firmware/modules/lpc4337_m4/drivers_devices/src/nrf24l01.c
	g_status[nrf24->spi.id] = Nrf24SpiReadWriteByte(nrf24,
			NRF24_R_REGISTER | reg);

	ucData = Nrf24SpiReadWriteByte(nrf24, NRF24_NOP);

	Nrf24CsHigh(nrf24);

	return ucData;
}

uint8_t Nrf24RegisterReadMulti(nrf24l01_t *nrf24, uint8_t reg, uint8_t *buffer, uint32_t length) {
	uint32_t i;

	Nrf24CsLow(nrf24);

	g_status[nrf24->spi.id] = Nrf24SpiReadWriteByte(nrf24, NRF24_R_REGISTER | reg);

	for (i = 0; i < length; i++) {
		buffer[i] = Nrf24SpiReadWriteByte(nrf24, NRF24_NOP);
	}

	Nrf24CsHigh(nrf24);

	return g_status[nrf24->spi.id];
}

void Nrf24RegisterWrite8(nrf24l01_t *nrf24, uint8_t reg, uint8_t value) {
	uint8_t buffer[2];

	buffer[0] = (NRF24_W_REGISTER | reg);
	buffer[1] = value;

	Nrf24CsLow(nrf24);

	//  Send address and get status
	g_status[nrf24->spi.id] = Nrf24SpiReadWriteByte(nrf24, buffer[0]);

	//  Send data
	Nrf24SpiReadWriteByte(nrf24, buffer[1]);

	Nrf24CsHigh(nrf24);
}

void Nrf24RegisterWriteMulti(nrf24l01_t *nrf24, uint8_t reg, uint8_t *data, uint16_t length) {
	Nrf24CsLow(nrf24);

	g_status[nrf24->spi.id] = Nrf24SpiReadWriteByte(nrf24,NRF24_W_REGISTER | reg);
	Nrf24SpiWriteMultiByte(nrf24, data, length);

	Nrf24CsHigh(nrf24);
}

void Nrf24SendCommand(nrf24l01_t *nrf24, uint8_t command, uint8_t *data, uint32_t length) {
	uint8_t rx_buffer[length+1];
	rx_buffer[0] = command;
	for (uint8_t i = 0; i < length; i++) {
		rx_buffer[i + 1] = data[i];
	}
	Nrf24CsLow(nrf24);
	Nrf24SpiWriteMultiByte(nrf24, rx_buffer, length + 1);
	Nrf24CsHigh(nrf24);
}

void Nrf24SendRcvCommand(nrf24l01_t *nrf24, uint8_t command, uint8_t *data, uint32_t length) {
	if (data) {
		uint32_t i = 0;

		Nrf24CsLow(nrf24);

		g_status[nrf24->spi.id] = Nrf24SpiReadWriteByte(nrf24, command);

		for (i = 0; i < length; i++) {
			data[i] = Nrf24SpiReadWriteByte(nrf24, NRF24_NOP);
		}

		Nrf24CsHigh(nrf24);
	}
}

/*-------- Interrupts ISR configuration --------*/

void Nrf24PrimaryDevISRConfig(nrf24l01_t *nrf24){
	primary_dev=nrf24;
	//nrf24->irq.dir=GPIO_IN_PULLUP;
	//GpioConfig(&nrf24->irq);
	//GpioInterruptConfig(&nrf24->irq, GPIO_IRQ_LEVEL_LOW, nrf24->pin_int_num, Nrf24PrimaryDevISR);
	GPIOInit( nrf24->irq , GPIO_INPUT);
	GPIOActivInt( GPIOGP0 , nrf24->irq , Nrf24PrimaryDevISR , 0);

}

void Nrf24SecondaryDevISRConfig(nrf24l01_t *nrf24){
	secondary_dev=nrf24;
	//nrf24->irq.dir=GPIO_IN_PULLUP;
	//GpioConfig(&nrf24->irq);
	//GpioInterruptConfig(&nrf24->irq, GPIO_IRQ_LEVEL_LOW, nrf24->pin_int_num, Nrf24SecondaryDevISR);
	GPIOInit( nrf24->irq , GPIO_INPUT);
	GPIOActivInt( GPIOGP1 , nrf24->irq , Nrf24SecondaryDevISR , 0);
}

void Nrf24PrimaryDevISR(){
	Nrf24SelectISR(primary_dev);
}

void Nrf24SecondaryDevISR(){
	Nrf24SelectISR(secondary_dev);
}

void Nrf24SelectISR(nrf24l01_t *nrf24){
	if(nrf24->mode==PRX){
		if(nrf24->en_ack_pay==true){
			Nrf24ReceiveDataACKPayISR(nrf24, rcv_fr_PTX,snd_to_PTX,BUF_SIZE);
		} else {
			Nrf24ReceiveDataISR(nrf24, rcv_fr_PTX);
		}
	} else {
		if(nrf24->en_ack_pay==true){
			Nrf24TransmitDataACKPayISR(nrf24,rcv_fr_PRX);
		} else {
			Nrf24TransmitDataISR(nrf24);
		}
	}
}

void Nrf24TransmitDataISR(nrf24l01_t *nrf24) {
	int8_t status;

	/* Check the interrupt status from module to see whether
	 * the interrupt is due to Data-Sent or ARC reached.
	 */
	status = Nrf24WaitForTxComplete(nrf24, 0);

	if (NRF24_TX_ARC_REACHED == status) {

		// Retry transmission
		Nrf24EnableTxMode(nrf24);

	} else if (NRF24_SUCCESS == status) {

		if (0 == Nrf24IsTxFifoEmpty(nrf24)) {
			// Since TX FIFO is not empty we'll retry sending the rest of the data
			Nrf24EnableTxMode(nrf24);
		} else {
			// No data in the FIFO we'll disable the TX mode
			Nrf24DisableTxMode(nrf24);
			Nrf24PowerDown(nrf24);
		}
	}
}

void Nrf24TransmitDataACKPayISR(nrf24l01_t *nrf24,uint8_t *rcv_ack_pay) {
	int8_t status;
	uint8_t interrupt_flag = 0;
	uint8_t pipe = 0;
	uint8_t data_amount;

	/* Check the interrupt status from module to see whether
	   the interrupt is due to Data-Sent/Rcv or ARC reached.
	 */
	interrupt_flag = Nrf24GetInterruptStatus(nrf24);

	if (interrupt_flag & INTERRUPT_DATA_READY) {

		/* Data ready in PTX device means it is an ACK payload
		 * Get the pipe address, data amount and data. */
		status = Nrf24IsDataReadyRx(nrf24, &pipe); // Always will be pipe0 in PTX mode

		if (NRF24_SUCCESS == status) {
			data_amount = Nrf24GetAckDataAmount(nrf24); //From pipe0

			if (data_amount > 0) {
				if (rcv_ack_pay!=null) {
					Nrf24ReadRxPayload(nrf24,rcv_ack_pay, data_amount);

					// Clear interrupt
					Nrf24ClearInterruptFlag(nrf24,INTERRUPT_DATA_READY);
				}
			}
		}
	}

	if (interrupt_flag & INTERRUPT_MAX_RT) {
		// Retry transmission
		Nrf24EnableTxMode(nrf24);
	}

	if (interrupt_flag & INTERRUPT_DATA_SENT) {

		if (0 == Nrf24IsTxFifoEmpty(nrf24)) {
			// Since TX FIFO is not empty we'll retry sending the rest of the data
			Nrf24EnableTxMode(nrf24);
		} else {
			// No data in the FIFO we'll disable the TX mode
			Nrf24DisableTxMode(nrf24);
			Nrf24PowerDown(nrf24);
		}
	}
}

void Nrf24ReceiveDataISR(nrf24l01_t *nrf24, uint8_t *data) {

	int8_t status;
	uint8_t pipe_no = 0;
	uint8_t temp;

	// Check which pipe contains data
	status = Nrf24IsDataReadyRx(nrf24, &pipe_no);

	if (NRF24_SUCCESS == status) {
		// Get data amount in the pipe
		temp = Nrf24GetRxDataAmount(nrf24, pipe_no);

		memset(data, 0x00, 32); //FIXME: change this implementation to avoid memset

		// Get data from the pipe
		status = Nrf24GetData(nrf24, pipe_no, data, temp);

	}
}

void Nrf24ReceiveDataACKPayISR(nrf24l01_t *nrf24, uint8_t *data,uint8_t *next_ack_pay, uint8_t ack_pay_len) {

	int8_t status;
	uint8_t pipe_no = 0;
	uint8_t temp;
	uint8_t interrupt_flag = 0;

	// Check which pipe contains data
	status = Nrf24IsDataReadyRx(nrf24, &pipe_no);

	if (NRF24_SUCCESS == status) {
		// Get data amount in the pipe
		temp = Nrf24GetRxDataAmount(nrf24, pipe_no);

		// Get data from the pipe
		status = Nrf24GetData(nrf24, pipe_no, data, temp);

		// Put the next ack payload
		Nrf24SetAckPayload(nrf24,next_ack_pay, pipe_no, ack_pay_len);
	}

	// Check whether ACK payload is properly sent
	interrupt_flag = Nrf24GetInterruptStatus(nrf24);

	if (INTERRUPT_DATA_SENT & interrupt_flag) {
		Nrf24ClearInterruptFlag(nrf24, INTERRUPT_DATA_SENT | INTERRUPT_MAX_RT);
	}
}

void Nrf24TxTick(){
	int8_t status;
	if (1 == Nrf24IsTxFifoFull(primary_dev)) {
		Nrf24FlushTX(primary_dev);
	}
	// Send data
	status = Nrf24SubmitData(primary_dev, snd_to_PRX,BUF_SIZE);
	if (NRF24_SUCCESS == status) {
		Nrf24EnableTxMode(primary_dev);
	}

}

/** @} doxygen end group definition */

